#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
aws_iam_role.node: Refreshing state... [id=eks-node-group-role]
aws_iam_role.cluster: Refreshing state... [id=eks-cluster-role]
aws_vpc.vpc_fiap: Refreshing state... [id=vpc-05e23a9d1a06e0bcd]
aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
aws_subnet.subnet_public[0]: Refreshing state... [id=subnet-099bd95ed721da5f9]
aws_subnet.subnet_public[2]: Refreshing state... [id=subnet-0ac801920887d078d]
aws_subnet.subnet_public[1]: Refreshing state... [id=subnet-0d2a17a7f3acad6fa]
aws_security_group.sg: Refreshing state... [id=sg-05d5f0bd1b74be6bb]
aws_eks_cluster.cluster: Refreshing state... [id=eks-spoo-ent9-backend]
data.aws_eks_cluster_auth.auth: Reading...
data.aws_eks_cluster.cluster: Reading...
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=eks-spoo-ent9-backend]
data.aws_eks_cluster.cluster: Read complete after 1s [id=eks-spoo-ent9-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_access_entry.access_entry will be created
  + resource "aws_eks_access_entry" "access_entry" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "group-2",
          + "group-Camilarspoo",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:user/camila"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.app_deploy_actions_access will be created
  + resource "aws_eks_access_entry" "app_deploy_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_entry.infra_actions_access will be created
  + resource "aws_eks_access_entry" "infra_actions_access" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-spoo-ent9-backend"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region            = "us-east-1"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_access_policy_association.access_entry_association will be created
  + resource "aws_eks_access_policy_association" "access_entry_association" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy"
      + principal_arn = "arn:aws:iam::579375260812:user/camila"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.app_deploy_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "app_deploy_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubAction-AppDeploy-Role"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_access_policy_association.infra_actions_admin_policy will be created
  + resource "aws_eks_access_policy_association" "infra_actions_admin_policy" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-spoo-ent9-backend"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::579375260812:role/GitHubActionRole-DatabaseInfra"
      + region        = "us-east-1"

      + access_scope {
          + type = "cluster"
        }
    }

  # aws_eks_node_group.node will be created
  + resource "aws_eks_node_group" "node" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-spoo-ent9-backend"
      + disk_size              = 50
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "nodeg-spoo-ent9-backend"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::579375260812:role/eks-node-group-role"
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-099bd95ed721da5f9",
          + "subnet-0ac801920887d078d",
          + "subnet-0d2a17a7f3acad6fa",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags_all = (known after apply)
      + vpc_id   = "vpc-05e23a9d1a06e0bcd"
    }

  # aws_route_table.rt_public will be created
  + resource "aws_route_table" "rt_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = "vpc-05e23a9d1a06e0bcd"
    }

  # aws_route_table_association.rt_association_0 will be created
  + resource "aws_route_table_association" "rt_association_0" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-099bd95ed721da5f9"
    }

  # aws_route_table_association.rt_association_1 will be created
  + resource "aws_route_table_association" "rt_association_1" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0d2a17a7f3acad6fa"
    }

  # aws_route_table_association.rt_association_2 will be created
  + resource "aws_route_table_association" "rt_association_2" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0ac801920887d078d"
    }

  # aws_s3_bucket.spoobucket-aula will be created
  + resource "aws_s3_bucket" "spoobucket-aula" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "spoo-ent9-backend"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_subnet.subnet_public[0] will be updated in-place
  ~ resource "aws_subnet" "subnet_public" {
        id                                             = "subnet-099bd95ed721da5f9"
      ~ tags                                           = {
            "Name"                                        = "fiap-terraform-aula"
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
            # (1 unchanged element hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # aws_subnet.subnet_public[1] will be updated in-place
  ~ resource "aws_subnet" "subnet_public" {
        id                                             = "subnet-0d2a17a7f3acad6fa"
      ~ tags                                           = {
            "Name"                                        = "fiap-terraform-aula"
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
            # (1 unchanged element hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # aws_subnet.subnet_public[2] will be updated in-place
  ~ resource "aws_subnet" "subnet_public" {
        id                                             = "subnet-0ac801920887d078d"
      ~ tags                                           = {
            "Name"                                        = "fiap-terraform-aula"
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
        }
      ~ tags_all                                       = {
          + "kubernetes.io/cluster/eks-spoo-ent9-backend" = "shared"
          + "kubernetes.io/role/elb"                      = "1"
            # (1 unchanged element hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # kubectl_manifest.namespace will be created
  + resource "kubectl_manifest" "namespace" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Namespace"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "nginx"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              name: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 14 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @2rspoo, Action: `pull_request`*